"""
Пользователь вводит целое положительное число.
Найдите самую большую цифру в числе.
Для решения используйте цикл while и арифметические операции.
"""

while True:
    number = input('Введите целое число: ')
    if number.isdigit():
        number = int(number)
        if number > 0:
            break
    else:
        print('Необходимо ввести целое положительное число')

# I'm deeply ashamed of anything you see bellow this comment, sorry. Your student.
# I'm still figuring it out...
number = str(number)
i = len(number)
i == i - 1
while i > 0:


    int(number[():()])
    if i > len(number)
        break


print(i)
print(number)
#while True:
